dot-emacs-dot-d-config.el
(defun config-visit ()
  (interactive)
  (find-file "~/.emacs.d/config.org"))
(global-set-key (kbd "C-c e") 'config-visit)

(defun config-reload ()
(interactive)
(org-babel-load-file (expand-file-name "~/.emacs.d/config.org")))
(global-set-key (kbd "C-c r") 'config-reload)

(use-package pdf-tools
  :ensure t)

(setq display-time-24hr-format t)
(display-time-mode 1)

(global-linum-mode t)
(line-number-mode 1)
(column-number-mode 1)

(use-package rainbow-delimiters
  :ensure t
  :init
  (add-hook 'prog-mode-hook #'rainbow-delimiters-mode))

(use-package swiper
  :ensure t
  :bind ("C-s" . swiper))

(put 'isearch-backward 'disabled "ISearch is disabled")
(put 'isearch-repeat-backward 'disabled "ISearch is disabled")
(put 'isearch-repeat-forward 'disabled "ISearch is disabled")
(put 'isearch-forward 'disabled "ISearch is disabled")

(setq org-src-window-setup 'current-window)

(use-package org-bullets
:ensure t
:config
(add-hook 'org-mode-hook (lambda () (org-bullets-mode))))

(setq org-clock-persist 'history)
(org-clock-persistence-insinuate)

;; (use-package lastpass
;;   :config
;;   ;; Set lastpass user
;;   (setq lastpass-user "pierre.lasorak@gmail.com")
;;   ;; Enable lastpass custom auth-source
;;   (lastpass-auth-source-enable))

(use-package sos
:ensure t)

(use-package nyan-mode
  :ensure t
  :config
  (nyan-mode 1))

(use-package ws-butler
:ensure t
:init)

(use-package exec-path-from-shell
:ensure t
:init
(when (memq window-system '(mac ns x))
  (exec-path-from-shell-initialize))
)

; deletes all the whitespace when you hit backspace or delete
(use-package hungry-delete
:ensure t
:config
(global-hungry-delete-mode))

(defun switch-to-minibuffer ()
  "Switch to minibuffer window."
  (interactive)
  (if (active-minibuffer-window)
      (select-window (active-minibuffer-window))
    (error "Minibuffer is not active")))

(global-set-key "\C-co" 'switch-to-minibuffer) ;; Bind to `C-c o'

(global-unset-key (kbd "C-w"))
(global-unset-key (kbd "M-w"))
(global-set-key (kbd "M-w") 'kill-region)
(global-set-key (kbd "C-w") 'kill-ring-save)

(setq inhibit-splash-screen t)

(tool-bar-mode -1)

(setq default-directory "~/Dropbox/Sussex_Postdoc")

(put 'upcase-region 'disabled nil)

(setq frame-title-format "%b")

(defalias 'yes-or-no-p 'y-or-n-p)

(use-package smartparens
  :ensure t
  :config
  (use-package smartparens-config)
  (use-package smartparens-html)
  (use-package smartparens-python)
  (use-package smartparens-latex)
  (smartparens-global-mode t)
  (show-smartparens-global-mode t)
  :bind 
  (("C-<down>" . sp-down-sexp)
   ("C-<up>"   . sp-up-sexp)
   ("M-<down>" . sp-backward-down-sexp)
   ("M-<up>"   . sp-backward-up-sexp)
   ("C-k"   . sp-kill-hybrid-sexp)
   ("C-c ("  . wrap-with-parens)
   ("C-c ["  . wrap-with-brackets)
   ("C-c {"  . wrap-with-braces)
   ("C-c '"  . wrap-with-single-quotes)
   ("C-c \"" . wrap-with-double-quotes)
   ("C-c _"  . wrap-with-underscores)
   ("C-c `"  . wrap-with-back-quotes)))

(show-paren-mode 1)
(setq show-paren-delay 0)
(defadvice show-paren-function
    (after show-matching-paren-offscreen activate)
  "If the matching paren is offscreen, show the matching line in the
          echo area. Has no effect if the character before point is not of
          the syntax class ')'."
  (interactive)
  (let* ((cb (char-before (point)))
         (matching-text (and cb
                               (char-equal (char-syntax cb) ?\) )
                               (blink-matching-open))))
      (when matching-text (message matching-text))))

;; source: http://steve.yegge.googlepages.com/my-dot-emacs-file
(defun rename-file-and-buffer (new-name)
  "Renames both current buffer and file it's visiting to NEW-NAME."
  (interactive "sNew name: ")
  (let ((name (buffer-name))
        (filename (buffer-file-name)))
    (if (not filename)
        (message "Buffer '%s' is not visiting a file!" name)
      (if (get-buffer new-name)
          (message "A buffer named '%s' already exists!" new-name)
        (progn
          (rename-file filename new-name 1)
          (rename-buffer new-name)
          (set-visited-file-name new-name)
          (set-buffer-modified-p nil))))))

(defun copy-file-path ()
    "Put the current file name on the clipboard"
    (interactive)
    (let ((filename (if (equal major-mode 'dired-mode)
                        default-directory
                      (buffer-file-name))))
      (when filename
        (kill-new filename)
        (message "Copied buffer file path '%s' to the clipboard." filename))))
  (defun copy-file-name ()
    "Copy the current buffer file name to the clipboard."
    (interactive)
    (let ((filename (if (equal major-mode 'dired-mode)
                        default-directory
                      (file-name-nondirectory (buffer-file-name)))))

      (when filename
        (kill-new filename)
        (message "Copied buffer file name '%s' to the clipboard." filename))))
(global-set-key (kbd "C-c c p") 'copy-file-path)
(global-set-key (kbd "C-c c n") 'copy-file-name)

(setq outline-minor-mode-prefix "\C-c \C-o") ; Or something else

(setq scroll-step 1)
(setq scroll-conservatively 100)

(setq ring-bell-function 'ignore)

(setq auto-save-default nil)

(when window-system (global-hl-line-mode t))

(put 'narrow-to-region 'disabled nil)

(global-unset-key (kbd "s-f"))
(global-set-key (kbd "s-f") 'toggle-frame-fullscreen)
(global-set-key (kbd "<s-return>") 'toggle-frame-fullscreen)

(use-package beacon
  :ensure t
  :init
  (beacon-mode 1))
(add-hook 'eshell-mode-hook (lambda ()
                                    (setq-local global-hl-line-mode
                                                nil)))
(add-hook 'term-mode-hook (lambda ()
                                    (setq-local global-hl-line-mode
                                                nil)))

(use-package popup-kill-ring
  :ensure t
  :bind ("M-y" . popup-kill-ring))

(use-package dashboard
  :ensure t
  :config
  (dashboard-setup-startup-hook)
  (setq dashboard-items '((recents . 10)))
  (setq dashboard-banner-logo-title "Yo Pierre!"))

(use-package mark-multiple
  :ensure t
  :bind ("C-c q" . 'mark-next-like-this))

(use-package expand-region
  :ensure t
  :bind ("C-q" . er/expand-region))

(use-package sudo-edit
  :ensure t
  :bind ("s-e" . sudo-edit))

(require 'tramp)
(add-to-list 'tramp-remote-path "~/global_install/bin/")

(use-package ggtags
:ensure t)
;; :config 
;; (add-hook 'c-mode-common-hook
;;           (lambda ()
;;             (when (derived-mode-p 'c-mode 'c++-mode 'java-mode)
;;               (ggtags-mode 1))))
;; )
