dot-emacs-dot-d-config.el

(global-subword-mode 1)

(setq-default c-default-style "linux")
(setq-default c-basic-offset 2)

(add-to-list 'auto-mode-alist '("\\.h\\'" . c++-mode))
(add-to-list 'auto-mode-alist '("\\.C\\'" . c++-mode))

(setq-default indent-tabs-mode nil)

(use-package flycheck
  :ensure t
  :init (global-flycheck-mode t))
(add-hook 'c++-mode-hook
          (lambda () (setq flycheck-gcc-include-path
                           (list (expand-file-name "/Users/plasorak/Applications/ROOT/include/")))))
(add-hook 'c++-mode-hook
          (lambda () (setq flycheck-clang-include-path
                           (list (expand-file-name "/Users/plasorak/Applications/ROOT/include/")))))

(use-package cmake-mode
  :ensure t)

(use-package which-key
  :ensure t
  :init
  (which-key-mode))

(use-package beacon
  :ensure t
  :init
  (beacon-mode 1))

(use-package symon
  :ensure t
  :bind
  ("M-s M-s" . symon-modeq))

(use-package spaceline
  :ensure t
  :config
  (require 'spaceline-config)
  (setq powerline-default-separator (quote arrow))
  (spaceline-spacemacs-theme))

(use-package diminish
  :ensure t
  :init
  (diminish 'which-key-mode)
  (diminish 'beacon-mode)
  (diminish 'subword-mode))

(setq load-path (cons "/Users/plasorak/Applications/ROOT/" load-path))
(require 'root-help)

(use-package company
  :ensure t
  :init
  (add-hook 'after-init-hook 'global-company-mode)
  :config
  (setq company-idle-delay 0)
  (setq company-minimum-prefix-length 3))


(with-eval-after-load 'company
  (define-key company-active-map (kbd "M-n") nil)
  (define-key company-active-map (kbd "M-p") nil)
  (define-key company-active-map (kbd "C-n") #'company-select-next)
  (define-key company-active-map (kbd "C-p") #'company-select-previous)
  (define-key company-active-map (kbd "SPC") #'company-abort))


(use-package company-irony
  :ensure t
  :config
  (require 'company)
  (add-to-list 'company-backends 'company-irony))

(use-package irony
  :ensure t
  :config
  (add-hook 'c++-mode-hook 'irony-mode)
  (add-hook 'c-mode-hook 'irony-mode)
  (add-hook 'irony-mode-hook 'irony-cdb-autosetup-compile-options))

(with-eval-after-load 'company
  (add-hook 'c++-mode-hook 'company-mode)
  (add-hook 'c-mode-hook 'company-mode))

(setq irony-additional-clang-options '("-I/Users/plasorak/Applications/ROOT/include"))

(use-package yasnippet
  :ensure t
  :config (use-package yasnippet-snippets
            :ensure t)
  (yas-reload-all))
(add-hook 'c++-mode-hook 'yas-minor-mode 1)
(add-hook 'c-mode-hook 'yas-minor-mode 1)
(add-hook 'python-mode-hook 'yas-minor-mode 1)
(add-hook 'org-mode-hook 'yas-minor-mode 1)

(use-package tex
  :ensure auctex
  :config
  (setq TeX-auto-save t)
  (setq TeX-parse-self t)
  (setq LaTeX-indent-level 4)
  (add-hook 'LaTeX-mode-hook 'visual-line-mode)
  (add-hook 'LaTeX-mode-hook 'LaTeX-math-mode)
  (add-hook 'LaTeX-mode-hook 'yas-minor-mode 1))

(use-package company-math
  :ensure t
  :config
  (add-hook 'LaTeX-mode-hook (lambda ()
                                 (add-to-list 'company-backends 'company-math-symbols-latex)
                                 (add-to-list 'company-backends 'company-latex-commands))))

(eval-after-load 'tex
  '(setq LaTeX-indent-environment-list
           '(("itemize" LaTeX-indent-tabular)
             ("enumerate" LaTeX-indent-tabular)
             ("verbatim" current-indentation)
             ("verbatim*" current-indentation)
             ("tabular" LaTeX-indent-tabular)
             ("tabular*" LaTeX-indent-tabular)
             ("align" LaTeX-indent-tabular)
             ("align*" LaTeX-indent-tabular)
             ("array" LaTeX-indent-tabular)
             ("eqnarray" LaTeX-indent-tabular)
             ("eqnarray*" LaTeX-indent-tabular)
             ("multline" LaTeX-indent-tabular)
             ("displaymath")
             ("equation")
             ("equation*")
             ("picture")
             ("tabbing"))))

(eval-after-load 'tex
  '(progn
     (defun save-compile-latex ()
         "Save and compile latex document"
         (interactive)
         (save-buffer)
         (TeX-command-sequence t t))

     (defun complete-if-no-space ()
         (interactive)
         (let ((cb (string (char-before))))
           (if (or (equal cb " ") (equal (point) (line-beginning-position)))
               (tab-to-tab-stop)
             (TeX-complete-symbol))))

    (add-hook 'LaTeX-mode-hook (lambda ()
          (define-key LaTeX-mode-map (kbd "<f5>") 'save-compile-latex)
          (define-key LaTeX-mode-map (kbd "<f7>") 'preview-clearout-buffer)
          (define-key LaTeX-mode-map (kbd "TAB") 'complete-if-no-space)
          (define-key LaTeX-mode-map (kbd "<tab>") 'complete-if-no-space)))))


(add-hook 'LaTeX-mode-hook (lambda ()
                               (LaTeX-add-environments
                                '("tikzcd" LaTeX-env-label))))
(custom-set-variables 
 '(font-latex-math-environments '("tikzcd" "display" "displaymath"
                                    "equation" "eqnarray" "gather"
                                    "multline"  "align" "alignat"
                                    "xalignat" "dmath")))
;; (eval-after-load 'preview
;;   '(progn
;;     (set-default 'preview-scale-function 1.7)
;;     (set-default 'preview-default-option-list
;;                   '("displaymath" "floats" "graphics" "textmath"))))

(use-package ido
  :ensure t)
(use-package ido-completing-read+
  :ensure t)
(use-package flx-ido
  :ensure t)
(use-package ido-hacks
  :ensure t)

(push ".exe"  completion-ignored-extensions)
(push ".so"   completion-ignored-extensions)
(push ".o"    completion-ignored-extensions)
(push ".dSYM" completion-ignored-extensions)
(push ".pdf"  completion-ignored-extensions)
(push ".root" completion-ignored-extensions)
(push ".png"  completion-ignored-extensions)

;; (custom-set-variables
;;  '(ido-enable-last-directory-history nil)
;;  '(ido-record-commands nil)
;;  '(ido-max-work-directory-list 0)
;;  '(ido-max-work-file-list 0))

(setq ido-enable-prefix nil
      ido-enable-last-directory-history nil
      ido-enable-flex-matching t
      ido-record-commands nil
      ido-max-work-directory-list 0
      ido-max-work-file-list 0
      ido-create-new-buffer 'always
      ido-use-filename-at-point 'guess
      ido-max-prospects 10
      ido-save-directory-list-file (expand-file-name "ido.hist")
      ido-everywhere t
      ido-default-file-method 'selected-window
      ido-auto-merge-work-directories-length -1
      ido-ignore-extensions t)
(ido-mode +1)
(ido-ubiquitous-mode +1)

;;; smarter fuzzy matching for ido
(flx-ido-mode +1)
;; disable ido faces to see flx highlights
(setq ido-use-faces nil)

(require 'which-func)
(which-function-mode 1)

(use-package smex
:ensure t
:init (smex-initialize))
(setq smex-save-file (expand-file-name ".smex-items" ))
(smex-initialize)
(global-set-key (kbd "M-x") 'smex)
(global-set-key (kbd "M-X") 'smex-major-mode-commands)

(defvar my-term-shell "/bin/zsh")
(defadvice ansi-term (before force-bash)
(interactive (list my-term-shell)))
(ad-activate 'ansi-term)

(global-set-key (kbd "C-x k") 'kill-current-buffer)
(global-unset-key (kbd "s-k"))
