dot-emacs-dot-d-config.org
** Kill all buffers
#+BEGIN_SRC emacs-lisp
(defun kill-all-buffers ()
  (interactive)
  (mapc 'kill-buffer (buffer-list)))
(global-set-key (kbd "C-M-s-k") 'kill-all-buffers)
#+END_SRC
** enable expert mode
#+BEGIN_SRC emacs-lisp
(setq ibuffer-expert t)
#+END_SRC
** switch  buffer
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-x C-b") 'ido-switch-buffer)
(global-set-key (kbd "C-x b") 'ido-switch-buffer)
#+END_SRC
* avy
#+BEGIN_SRC emacs-lisp
(use-package avy
:ensure t
:bind ("C-;" . avy-goto-char))
#+END_SRC
* Switch-window
#+BEGIN_SRC emacs-lisp
(use-package switch-window
:ensure t
:config
 (setq switch-window-input-style 'minibuffer)
 (setq switch-window-increase 4)
 (setq switch-window-threshold 2)
:bind
([remap other-window] . switch-window))
#+END_SRC
** follow the switch-window
#+BEGIN_SRC emacs-lisp
(defun split-and-follow-horizontally ()
(interactive)
(split-window-below)
(other-window 1))
(global-set-key (kbd "C-x 2") 'split-and-follow-horizontally)
(defun split-and-follow-vertically ()
(interactive)
(split-window-right)
(other-window 1))
(global-set-key (kbd "C-x 3") 'split-and-follow-vertically)
(global-unset-key (kbd "s-t"))
(global-set-key (kbd "s-t") 'split-and-follow-vertically)
#+END_SRC
* Convenient function
** Copy line
#+BEGIN_SRC emacs-lisp
(defun copy-whole-line ()
(interactive)
(save-excursion
(kill-new
(buffer-substring
(point-at-bol)
(point-at-eol)))))
(global-set-key (kbd "C-c w l") 'copy-whole-line)
#+END_SRC
* ART-FCL
#+BEGIN_SRC emacs-lisp
(load "~/.emacs.d/fcl-mode.el" nil t t)
(add-to-list 'auto-mode-alist '("\\.fcl$" . art-fhicl-mode))
#+END_SRC
* Logging
#+BEGIN_SRC emacs-lisp
(load  "~/.emacs.d/interaction-log.el" nil t t)
(require 'interaction-log)
;;(interaction-log-mode +1)
(global-set-key
(kbd "C-c l")
(lambda () (interactive) (display-buffer ilog-buffer-name)))
#+END_SRC
* GIT integration
#+BEGIN_SRC emacs-lisp
(use-package magit
:ensure t
)
#+END_SRC

* Directory aliases
#+BEGIN_SRC emacs-lisp
(require 'ido)
(require 'dired)

(defconst *my-dired-dirs*
    (list (cons "present"  "~/Dropbox/References/MyRef/Postdoc_Sussex_Ref/Presentation")
          (cons "work"     "~/Dropbox/Sussex_Postdoc/")
          (cons "cernhome" "/ssh:lxplus7:~/")
          (cons "cernafs"  "/ssh:lxplus7:/afs/cern.ch/work/p/plasorak/")
          (cons "np04sw"   "/ssh:lxplus7|ssh:np04-srv-019:/nfs/sw/work_dirs/plasorak2/")
          (cons "fnalapp"  "/ssh:dunegpvm15:/dune/app/users/plasorak")))

(defconst *my-dired-aliases*
    (mapcar (lambda (e) (car e)) *my-dired-dirs*))

(defun my-dired-open-alias ()
"Open dired alias?"
    (interactive)
      (setq alias
            (ido-completing-read "Alias: "
                                 ,*my-dired-aliases*
                                 nil t))
    (if (and (stringp alias) (> (length alias) 0 ))
        (let ((pair (assoc alias *my-dired-dirs*)))
          (if pair
              (dired (cdr pair))
            (error "Invalid alias %s" alias)))
      (error "Invalid alias %s" alias)))

(global-set-key (kbd "s-d") 'my-dir-open-alias)
#+END_SRC
* Things that have to go in the end
** Get rid of cmd-t, ctrl-t, ctrl-v, ctrl-[
#+BEGIN_SRC emacs-lisp
  (global-unset-key (kbd "s-t"))
  (global-unset-key (kbd "C-t"))
  (global-unset-key (kbd "C-v"))
;; DO NOT UNCOMMENT THIS OTHERWISE EVIL WILL COME ON YOU
;; (and meta will just stop working... :'( )
;;  (global-unset-key (kbd "C-["))
#+END_SRC
* Remove arrows and mouse
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "<left>"))
(global-unset-key (kbd "<right>"))
(global-unset-key (kbd "<up>"))
(global-unset-key (kbd "<down>"))

(global-unset-key (kbd "<M-left>"))
(global-unset-key (kbd "<M-right>"))
(global-unset-key (kbd "<M-up>"))
(global-unset-key (kbd "<M-down>"))

(global-unset-key (kbd "C-x <left>"))
(global-unset-key (kbd "C-x <right>"))

(add-hook 'ansi-term-hook
          (lambda ()
            (local-unset-key (kbd "<left>"))
            (local-unset-key (kbd "<right>"))
            (local-unset-key (kbd "<up>"))
            (local-unset-key (kbd "<down>"))))
(use-package disable-mouse
:ensure t)
(global-disable-mouse-mode)
#+END_SRC
* Markdown mode
#+BEGIN_SRC emacs-lisp
(use-package markdown-mode
  :ensure t
  :mode (("README\\.md\\'" . gfm-mode)
         ("\\.md\\'" . markdown-mode)
         ("\\.markdown\\'" . markdown-mode))
  :init (setq markdown-command "multimarkdown"))
#+END_SRC
